---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength
source: html/90cdbf2f-395d-515f-1fae-6d0f0a687797.htm
---
# RebarShapeConstraintProjectedSegmentLength Methods

Return the Id of the parameter associated with this constraint.